### L'object Pandas 
##### Creation

In [2]:
import pandas as pd

In [13]:
## from a dictionnaire
data = {'Nom' : ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Ville': ['Paris', 'Lyon', 'Marseille']}
df = pd.DataFrame(data)
print(df)

       Nom  Age      Ville
0    Alice   25      Paris
1      Bob   30       Lyon
2  Charlie   35  Marseille

In [8]:
## from a Numby table
import numpy as np
data = np.array([[1, 2], [3,4], [5,6]])
df2 = pd.DataFrame(data, columns= ['Coln1', 'Coln2'])
print(df2)

   Coln1  Coln2
0      1      2
1      3      4
2      5      6

In [6]:
## from a csv file
# pd.read_csv('', delimiter= ";")

## getting to a column
print(df['Nom'])

In [16]:
## ajout colonne
df['Score'] =  [85 , 90, 88]

In [17]:
df['Age'] = df['Age'] + 1 
df

       Nom  Age      Ville  Score
0    Alice   26      Paris     85
1      Bob   31       Lyon     90
2  Charlie   36  Marseille     88

In [18]:
## supprimer une colonnne
df.drop('Score', axis = 1 , inplace = True)
print(df)

       Nom  Age      Ville
0    Alice   26      Paris
1      Bob   31       Lyon
2  Charlie   36  Marseille

#### acceder par indexation avec loc

In [20]:
## first row 
print(df.loc[0])

Nom      Alice
Age         26
Ville    Paris
Name: 0, dtype: object

In [23]:
## first two rows with a specific rows
print(df.loc[0:1, ['Nom', 'Ville']])

     Nom  Ville
0  Alice  Paris
1    Bob   Lyon

#### acceder par iloc

In [29]:
## acceder par indexation positionnelle avec iloc
print(df.iloc[0,0])
## selection des deux premieres lignes et  deux premieres colonnes
print('selection of two first  rows  et  and columns')
print(df.iloc[0:2, 0:2])

Alice
selection of two first  rows  et  and columns
     Nom  Age
0  Alice   26
1    Bob   31

In [30]:
#### filtrage 
## rows where age over 30
print(df[df['Age'] > 30])

       Nom  Age      Ville
1      Bob   31       Lyon
2  Charlie   36  Marseille

In [33]:
#### define a columns as index
df.set_index('Nom', inplace = True)
df

         index  Age      Ville
Nom
Alice        0   26      Paris
Bob          1   31       Lyon
Charlie      2   36  Marseille

In [34]:
## reinitialize index by default
df.reset_index(inplace=True)
df

       Nom  index  Age      Ville
0    Alice      0   26      Paris
1      Bob      1   31       Lyon
2  Charlie      2   36  Marseille

#### Adding a row

In [40]:
df.drop('index', axis = 1, inplace = True)
df

       Nom  Age      Ville
0    Alice   26      Paris
1      Bob   31       Lyon
2  Charlie   36  Marseille

In [41]:
df.loc[len(df)] = ['Gildas','100', 'Niamey' ]

In [42]:
df

       Nom  Age      Ville
0    Alice   26      Paris
1      Bob   31       Lyon
2  Charlie   36  Marseille
3   Gildas  100     Niamey

In [44]:
## adding many rows
new_df = pd.DataFrame({'Nom' : ['Norbert', 'Bobo', 'Charlin'], 'Age': [42, 30, 31], 'Ville': ['Paris', 'Cotonou', 'Bohicon']})

df = pd.concat([df , new_df], ignore_index= True)
df

       Nom  Age      Ville
0    Alice   26      Paris
1      Bob   31       Lyon
2  Charlie   36  Marseille
3   Gildas  100     Niamey
4  Norbert   42      Paris
5     Bobo   30    Cotonou
6  Charlin   31    Bohicon

In [47]:
df[df['Age'] == 31]

       Nom Age    Ville
1      Bob  31     Lyon
6  Charlin  31  Bohicon

#### stats descriptive

In [48]:
df.describe()

          Nom  Age  Ville
count       7    7      7
unique      7    6      6
top     Alice   31  Paris
freq        1    2      2

In [57]:
df['Age'] = df['Age'].astype(int)

## TRI

In [58]:
df.sort_values(by ='Age', ascending= False, inplace = True)
df

       Nom  Age      Ville
3   Gildas  100     Niamey
4  Norbert   42      Paris
2  Charlie   36  Marseille
6  Charlin   31    Bohicon
1      Bob   31       Lyon
5     Bobo   30    Cotonou
0    Alice   26      Paris

### Advances manipulation

In [67]:
df_new = pd.DataFrame({'Nom': ['Gildas', 'Alice', 'Myriam', 'Bob', 'Lucas'], 'Color': ['Black', 'White', 'Rose', 'Green', 'red']})

In [82]:
pd.merge(df, df_new, how= 'inner',  on= 'Nom')

      Nom  Age   Ville  Color
0  Gildas  100  Niamey  Black
1     Bob   31    Lyon  Green
2   Alice   26   Paris  White

In [89]:
### group by
df_group = df.groupby('Ville')['Age'].mean()
df_group

Ville
Bohicon       31.0
Cotonou       30.0
Lyon          31.0
Marseille     36.0
Niamey       100.0
Paris         34.0
Name: Age, dtype: float64

In [90]:
data = pd.DataFrame({
    "service": ["IT", "IT", "RH", "RH", "RH"],
    "absence": ["Maladie", "Congé", "Maladie", "Congé", "Maladie"],
    "jours": [2, 1, 3, 2, 1]
})
data

  service  absence  jours
0      IT  Maladie      2
1      IT    Congé      1
2      RH  Maladie      3
3      RH    Congé      2
4      RH  Maladie      1

##### groupby simple (1 colonne)
➕ Somme par service

In [98]:
# total des jours par service
data.groupby('service')['jours'].sum()

service
IT    3
RH    6
Name: jours, dtype: int64

In [99]:
## duree moyenne des
data.groupby('service')["jours"].mean()

service
IT    1.5
RH    2.0
Name: jours, dtype: float64

In [100]:
### plusieurs aggregations
data.groupby("service").agg(
    total_jours = ("jours", "sum"),
    moyenne_jours = ("jours", "mean"),
    nbre_absences = ("jours", "count")
)

         total_jours  moyenne_jours  nbre_absences
service
IT                 3            1.5              2
RH                 6            2.0              3

In [104]:
## groupby + filtre
data.groupby("service").filter(lambda x: x["jours"].sum() > 3)

  service  absence  jours
2      RH  Maladie      3
3      RH    Congé      2
4      RH  Maladie      1